{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_168442",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 8,
            "activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense336883",
            "trainable": true,
            "batch_input_shape": [null, 4],
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 3,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense336884",
            "trainable": true
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 4.20.0",
    "backend": "tensor_flow.js"
  },
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v4.20.0",
  "convertedBy": null,
  "weightsManifest": [
    {
      "paths": ["gen-337-model.weights.bin"],
      "weights": [
        {
          "name": "dense_Dense336883/kernel",
          "shape": [4, 8],
          "dtype": "float32"
        },
        { "name": "dense_Dense336883/bias", "shape": [8], "dtype": "float32" },
        {
          "name": "dense_Dense336884/kernel",
          "shape": [8, 3],
          "dtype": "float32"
        },
        { "name": "dense_Dense336884/bias", "shape": [3], "dtype": "float32" }
      ]
    }
  ]
}
